Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16E.atdf
          <instance name="AFEC1">
            <register-group address-space="base" name="AFEC1" name-in-module="AFEC" offset="0x400B4000"/>
            
          <signals>
              <signal pad="PB2" function="X1" group="AFE1_AD" index="0"/>
              <signal pad="PB2" function="X1" group="WKUP" index="12"/>
              <signal pad="PB3" function="X1" group="AFE1_AD" index="1"/>
              <signal pad="PA21" function="X1" group="AFE1_AD" index="2"/>
              <signal pad="PA22" function="X1" group="AFE1_AD" index="3"/>
              <signal pad="PC1" function="X1" group="AFE1_AD" index="4"/>
              <signal pad="PC2" function="X1" group="AFE1_AD" index="5"/>
              <signal pad="PC3" function="X1" group="AFE1_AD" index="6"/>
              <signal pad="PC4" function="X1" group="AFE1_AD" index="7"/>
            </signals>
          </instance>
        </module>
        <module name="CAN" id="6019" version="N">
          <instance name="CAN0">
            <register-group address-space="base" name="CAN0" name-in-module="CAN" offset="0x40010000"/>
            
          <signals>
              <signal pad="PB3" function="A" group="CANRX" index="0"/>
              <signal pad="PB2" function="A" group="CANTX" index="0"/>
            </signals>
          </instance>
          <instance name="CAN1">
            <register-group address-space="base" name="CAN1" name-in-module="CAN" offset="0x40014000"/>
            
          <signals>
              <signal pad="PC12" function="C" group="CANRX" index="1"/>
              <signal pad="PC15" function="C" group="CANTX" index="1"/>
            </signals>
          </instance>
        </module>
        <module name="CHIPID" id="6417" version="M">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
          </instance>
        </module>
        <module name="CMCC" id="11108" version="B">
          <instance name="CMCC">
            <register-group address-space="base" name="CMCC" name-in-module="CMCC" offset="0x400C4000"/>
          </instance>
        </module>
        <module name="CRCCU" id="11001" version="E">
          <instance name="CRCCU">
            <register-group address-space="base" name="CRCCU" name-in-module="CRCCU" offset="0x40044000"/>
          </instance>
        </module>
        <module name="DACC" id="6461" version="F">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x400B8000"/>
            
          <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PB14" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
          </instance>
        </module>
        <module name="DMAC" id="6233" version="O">
          <instance name="DMAC">
            <register-group address-space="base" name="DMAC" name-in-module="DMAC" offset="0x400C0000"/>
          </instance>
        </module>
        <module name="EFC" id="6450" version="G">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
          <parameters><param name="FLASH_SIZE" value="1048576"/><param name="PAGE_SIZE" value="512"/><param name="PAGES_PR_REGION" value="16"/></parameters></instance>
        </module>
        <module name="GMAC" id="11046" version="D">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x40034000"/>
            
          <signals>
              <signal pad="PD13" function="A" group="GCOL"/>
              <signal pad="PD10" function="A" group="GCRS"/>
              <signal pad="PD4" function="A" group="GCRSDV"/>
              <signal pad="PD4" function="A" group="GRXDV"/>
              <signal pad="PD8" function="A" group="GMDC"/>
              <signal pad="PD9" function="A" group="GMDIO"/>
              <signal pad="PD14" function="A" group="GRXCK"/>
              <signal pad="PD7" function="A" group="GRXER"/>
              <signal pad="PD5" function="A" group="GRX" index="0"/>
              <signal pad="PD6" function="A" group="GRX" index="0"/>
              <signal pad="PD11" function="A" group="GRX" index="2"/>
              <signal pad="PD12" function="A" group="GRX" index="3"/>
              <signal pad="PD0" function="A" group="GTXCK"/>
              <signal pad="PD0" function="A" group="GREFCK"/>
              <signal pad="PD1" function="A" group="GTXEN"/>
              <signal pad="PD17" function="A" group="GTXER"/>
              <signal pad="PD2" function="A" group="GTX" index="0"/>
              <signal pad="PD3" function="A" group="GTX" index="1"/>
              <signal pad="PD15" function="A" group="GTX" index="2"/>
              <signal pad="PD16" function="A" group="GTX" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="D">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="HSMCI" id="6449" version="K">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40080000"/>
            
          <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA29" function="C" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="MATRIX" id="6342" version="C">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
