Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16E.atdf
        <register caption="Channel Register Selection" name="AFE_CSELR" offset="0x64" rw="R" size="4">
          <bitfield caption="Channel Selection" mask="0x0000000F" name="CSEL"/>
        </register>
        <register caption="Channel Data Register" name="AFE_CDR" offset="0x68" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Offset Compensation Register" name="AFE_COCR" offset="0x6C" rw="R" size="4">
          <bitfield caption="Analog Offset" mask="0x00000FFF" name="AOFF"/>
        </register>
        <register caption="Temperature Sensor Mode Register" name="AFE_TEMPMR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Temperature Sensor RTC Trigger mode" mask="0x00000001" name="RTCT"/>
          <bitfield caption="Temperature Comparison Mode" mask="0x00000030" name="TEMPCMPMOD" values="AFE_TEMPMR__TEMPCMPMOD"/>
        </register>
        <register caption="Temperature Compare Window Register" name="AFE_TEMPCWR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Temperature Low Threshold" mask="0x0000FFFF" name="TLOWTHRES"/>
          <bitfield caption="Temperature High Threshold" mask="0xFFFF0000" name="THIGHTHRES"/>
        </register>
        <register caption="Analog Control Register" name="AFE_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="AFE Bias Current Control" mask="0x00000300" name="IBCTL"/>
        </register>
        <register caption="Write Protect Mode Register" name="AFE_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="AFE_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="AFE_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="AFE_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="AFE_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="AFE_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="AFE_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="AFE_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
        </register-group>
      <value-group caption="" name="AFE_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="AFE_MR__TRGSEL">
        <value caption="ADTRG pin" name="AFE_TRIG0" value="0x0"/>
        <value caption="TIO Output of the Timer Counter Channel 0" name="AFE_TRIG1" value="0x1"/>
        <value caption="TIO Output of the Timer Counter Channel 1" name="AFE_TRIG2" value="0x2"/>
        <value caption="TIO Output of the Timer Counter Channel 2" name="AFE_TRIG3" value="0x3"/>
        <value caption="PWM Event Line 0" name="AFE_TRIG4" value="0x4"/>
        <value caption="PWM Event Line 1" name="AFE_TRIG5" value="0x5"/>
      </value-group>
      <value-group caption="" name="AFE_MR__SLEEP">
        <value caption="Normal Mode: The AFE Core and reference voltage circuitry are kept ON between conversions" name="NORMAL" value="0"/>
        <value caption="Sleep Mode: The AFE Core and reference voltage circuitry are OFF between conversions" name="SLEEP" value="1"/>
      </value-group>
      <value-group caption="" name="AFE_MR__FWUP">
        <value caption="Normal Sleep Mode: The sleep mode is defined by the SLEEP bit" name="OFF" value="0"/>
        <value caption="Fast Wake Up Sleep Mode: The Voltage reference is ON between conversions and AFE Core is OFF" name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="AFE_MR__FREERUN">
        <value caption="Normal Mode" name="OFF" value="0"/>
        <value caption="Free Run Mode: Never wait for any trigger." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="AFE_MR__STARTUP">
        <value caption="0 periods of AFEClock" name="SUT0" value="0x0"/>
        <value caption="8 periods of AFEClock" name="SUT8" value="0x1"/>
        <value caption="16 periods of AFEClock" name="SUT16" value="0x2"/>
        <value caption="24 periods of AFEClock" name="SUT24" value="0x3"/>
        <value caption="64 periods of AFEClock" name="SUT64" value="0x4"/>
        <value caption="80 periods of AFEClock" name="SUT80" value="0x5"/>
        <value caption="96 periods of AFEClock" name="SUT96" value="0x6"/>
        <value caption="112 periods of AFEClock" name="SUT112" value="0x7"/>
        <value caption="512 periods of AFEClock" name="SUT512" value="0x8"/>
        <value caption="576 periods of AFEClock" name="SUT576" value="0x9"/>
        <value caption="640 periods of AFEClock" name="SUT640" value="0xA"/>
        <value caption="704 periods of AFEClock" name="SUT704" value="0xB"/>
        <value caption="768 periods of AFEClock" name="SUT768" value="0xC"/>
        <value caption="832 periods of AFEClock" name="SUT832" value="0xD"/>
        <value caption="896 periods of AFEClock" name="SUT896" value="0xE"/>
        <value caption="960 periods of AFEClock" name="SUT960" value="0xF"/>
      </value-group>
      <value-group caption="" name="AFE_MR__SETTLING">
        <value caption="3 periods of AFEClock" name="AST3" value="0x0"/>
        <value caption="5 periods of AFEClock" name="AST5" value="0x1"/>
        <value caption="9 periods of AFEClock" name="AST9" value="0x2"/>
        <value caption="17 periods of AFEClock" name="AST17" value="0x3"/>
      </value-group>
