Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16E.atdf
      <value-group caption="" name="AFE_MR__ANACH">
        <value caption="No analog change on channel switching: DIFF0, GAIN0 and OFF0 are used for all channels" name="NONE" value="0"/>
        <value caption="Allows different analog settings for each channel. See AFE_CGR and AFE_CDOR Registers" name="ALLOWED" value="1"/>
      </value-group>
      <value-group caption="" name="AFE_MR__USEQ">
        <value caption="Normal Mode: The controller converts channels in a simple numeric order." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence Mode: The sequence respects what is defined in AFE_SEQR1 and AFE_SEQR2 registers." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="AFE_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="AFE_EMR__RES">
        <value caption="12-bit resolution, AFE sample rate is maximum (no averaging)." name="NO_AVERAGE" value="0x0"/>
        <value caption="10-bit resolution, AFE sample rate is maximum (no averaging)." name="LOW_RES" value="0x1"/>
        <value caption="13-bit resolution, AFE sample rate divided by 4 (averaging)." name="OSR4" value="0x2"/>
        <value caption="14-bit resolution, AFE sample rate divided by 16 (averaging)." name="OSR16" value="0x3"/>
        <value caption="15-bit resolution, AFE sample rate divided by 64 (averaging)." name="OSR64" value="0x4"/>
        <value caption="16-bit resolution, AFE sample rate divided by 256 (averaging)." name="OSR256" value="0x5"/>
      </value-group>
      <value-group caption="" name="AFE_TEMPMR__TEMPCMPMOD">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
    </module>
    <module name="CAN" caption="Controller Area Network" id="6019" version="N">
      <register-group name="CAN"><register caption="Mode Register" name="CAN_MR" offset="0x0000" rw="RW" size="4">
          <bitfield caption="CAN Controller Enable" mask="0x00000001" name="CANEN"/>
          <bitfield caption="Disable/Enable Low Power Mode" mask="0x00000002" name="LPM"/>
          <bitfield caption="Disable/Enable Autobaud/Listen mode" mask="0x00000004" name="ABM"/>
          <bitfield caption="Disable/Enable Overload Frame" mask="0x00000008" name="OVL"/>
          <bitfield caption="Timestamp messages at each end of Frame" mask="0x00000010" name="TEOF"/>
          <bitfield caption="Disable/Enable Time Triggered Mode" mask="0x00000020" name="TTM"/>
          <bitfield caption="Enable Timer Freeze" mask="0x00000040" name="TIMFRZ"/>
          <bitfield caption="Disable Repeat" mask="0x00000080" name="DRPT"/>
        </register>
        <register caption="Interrupt Enable Register" name="CAN_IER" offset="0x0004" rw="W" size="4">
          <bitfield caption="Mailbox 0 Interrupt Enable" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Interrupt Enable" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Interrupt Enable" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Interrupt Enable" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Interrupt Enable" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Interrupt Enable" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Interrupt Enable" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Interrupt Enable" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode Interrupt Enable" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit Interrupt Enable" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode Interrupt Enable" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode Interrupt Enable" mask="0x00080000" name="BOFF"/>
          <bitfield caption="Sleep Interrupt Enable" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="Wakeup Interrupt Enable" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow Interrupt Enable" mask="0x00400000" name="TOVF"/>
          <bitfield caption="TimeStamp Interrupt Enable" mask="0x00800000" name="TSTP"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x01000000" name="CERR"/>
          <bitfield caption="Stuffing Error Interrupt Enable" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error Interrupt Enable" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error Interrupt Enable" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error Interrupt Enable" mask="0x10000000" name="BERR"/>
        </register>
        <register caption="Interrupt Disable Register" name="CAN_IDR" offset="0x0008" rw="W" size="4">
          <bitfield caption="Mailbox 0 Interrupt Disable" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Interrupt Disable" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Interrupt Disable" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Interrupt Disable" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Interrupt Disable" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Interrupt Disable" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Interrupt Disable" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Interrupt Disable" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode Interrupt Disable" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit Interrupt Disable" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode Interrupt Disable" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode Interrupt Disable" mask="0x00080000" name="BOFF"/>
          <bitfield caption="Sleep Interrupt Disable" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="Wakeup Interrupt Disable" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow Interrupt" mask="0x00400000" name="TOVF"/>
          <bitfield caption="TimeStamp Interrupt Disable" mask="0x00800000" name="TSTP"/>
          <bitfield caption="CRC Error Interrupt Disable" mask="0x01000000" name="CERR"/>
          <bitfield caption="Stuffing Error Interrupt Disable" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error Interrupt Disable" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error Interrupt Disable" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error Interrupt Disable" mask="0x10000000" name="BERR"/>
        </register>
        <register caption="Interrupt Mask Register" name="CAN_IMR" offset="0x000C" rw="R" size="4">
          <bitfield caption="Mailbox 0 Interrupt Mask" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Interrupt Mask" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Interrupt Mask" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Interrupt Mask" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Interrupt Mask" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Interrupt Mask" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Interrupt Mask" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Interrupt Mask" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode Interrupt Mask" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit Interrupt Mask" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode Interrupt Mask" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode Interrupt Mask" mask="0x00080000" name="BOFF"/>
          <bitfield caption="Sleep Interrupt Mask" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="Wakeup Interrupt Mask" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow Interrupt Mask" mask="0x00400000" name="TOVF"/>
          <bitfield caption="Timestamp Interrupt Mask" mask="0x00800000" name="TSTP"/>
          <bitfield caption="CRC Error Interrupt Mask" mask="0x01000000" name="CERR"/>
          <bitfield caption="Stuffing Error Interrupt Mask" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error Interrupt Mask" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error Interrupt Mask" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error Interrupt Mask" mask="0x10000000" name="BERR"/>
        </register>
        <register caption="Status Register" name="CAN_SR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mailbox 0 Event" mask="0x00000001" name="MB0"/>
          <bitfield caption="Mailbox 1 Event" mask="0x00000002" name="MB1"/>
          <bitfield caption="Mailbox 2 Event" mask="0x00000004" name="MB2"/>
          <bitfield caption="Mailbox 3 Event" mask="0x00000008" name="MB3"/>
          <bitfield caption="Mailbox 4 Event" mask="0x00000010" name="MB4"/>
          <bitfield caption="Mailbox 5 Event" mask="0x00000020" name="MB5"/>
          <bitfield caption="Mailbox 6 Event" mask="0x00000040" name="MB6"/>
          <bitfield caption="Mailbox 7 Event" mask="0x00000080" name="MB7"/>
          <bitfield caption="Error Active Mode" mask="0x00010000" name="ERRA"/>
          <bitfield caption="Warning Limit" mask="0x00020000" name="WARN"/>
          <bitfield caption="Error Passive Mode" mask="0x00040000" name="ERRP"/>
          <bitfield caption="Bus Off Mode" mask="0x00080000" name="BOFF"/>
          <bitfield caption="CAN controller in Low power Mode" mask="0x00100000" name="SLEEP"/>
          <bitfield caption="CAN controller is not in Low power Mode" mask="0x00200000" name="WAKEUP"/>
          <bitfield caption="Timer Overflow" mask="0x00400000" name="TOVF"/>
          <bitfield caption="" mask="0x00800000" name="TSTP"/>
          <bitfield caption="Mailbox CRC Error" mask="0x01000000" name="CERR"/>
          <bitfield caption="Mailbox Stuffing Error" mask="0x02000000" name="SERR"/>
          <bitfield caption="Acknowledgment Error" mask="0x04000000" name="AERR"/>
          <bitfield caption="Form Error" mask="0x08000000" name="FERR"/>
          <bitfield caption="Bit Error" mask="0x10000000" name="BERR"/>
          <bitfield caption="Receiver busy" mask="0x20000000" name="RBSY"/>
          <bitfield caption="Transmitter busy" mask="0x40000000" name="TBSY"/>
          <bitfield caption="Overload busy" mask="0x80000000" name="OVLSY"/>
        </register>
        <register caption="Baudrate Register" name="CAN_BR" offset="0x0014" rw="RW" size="4">
          <bitfield caption="Phase 2 segment" mask="0x00000007" name="PHASE2"/>
          <bitfield caption="Phase 1 segment" mask="0x00000070" name="PHASE1"/>
          <bitfield caption="Programming time segment" mask="0x00000700" name="PROPAG"/>
          <bitfield caption="Re-synchronization jump width" mask="0x00003000" name="SJW"/>
          <bitfield caption="Baudrate Prescaler." mask="0x007F0000" name="BRP"/>
          <bitfield caption="Sampling Mode" mask="0x01000000" name="SMP" values="CAN_BR__SMP"/>
        </register>
