Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16E.atdf
        <register caption="FIFO Memory Aperture0 166" name="HSMCI_FIFO166" offset="0x498" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 167" name="HSMCI_FIFO167" offset="0x49C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 168" name="HSMCI_FIFO168" offset="0x4A0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 169" name="HSMCI_FIFO169" offset="0x4A4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 170" name="HSMCI_FIFO170" offset="0x4A8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 171" name="HSMCI_FIFO171" offset="0x4AC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 172" name="HSMCI_FIFO172" offset="0x4B0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 173" name="HSMCI_FIFO173" offset="0x4B4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 174" name="HSMCI_FIFO174" offset="0x4B8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 175" name="HSMCI_FIFO175" offset="0x4BC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 176" name="HSMCI_FIFO176" offset="0x4C0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 177" name="HSMCI_FIFO177" offset="0x4C4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 178" name="HSMCI_FIFO178" offset="0x4C8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 179" name="HSMCI_FIFO179" offset="0x4CC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 180" name="HSMCI_FIFO180" offset="0x4D0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 181" name="HSMCI_FIFO181" offset="0x4D4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 182" name="HSMCI_FIFO182" offset="0x4D8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 183" name="HSMCI_FIFO183" offset="0x4DC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 184" name="HSMCI_FIFO184" offset="0x4E0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 185" name="HSMCI_FIFO185" offset="0x4E4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 186" name="HSMCI_FIFO186" offset="0x4E8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 187" name="HSMCI_FIFO187" offset="0x4EC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 188" name="HSMCI_FIFO188" offset="0x4F0" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 189" name="HSMCI_FIFO189" offset="0x4F4" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 190" name="HSMCI_FIFO190" offset="0x4F8" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 191" name="HSMCI_FIFO191" offset="0x4FC" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 192" name="HSMCI_FIFO192" offset="0x500" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 193" name="HSMCI_FIFO193" offset="0x504" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 194" name="HSMCI_FIFO194" offset="0x508" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 195" name="HSMCI_FIFO195" offset="0x50C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 196" name="HSMCI_FIFO196" offset="0x510" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 197" name="HSMCI_FIFO197" offset="0x514" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 198" name="HSMCI_FIFO198" offset="0x518" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 199" name="HSMCI_FIFO199" offset="0x51C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 200" name="HSMCI_FIFO200" offset="0x520" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 201" name="HSMCI_FIFO201" offset="0x524" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 202" name="HSMCI_FIFO202" offset="0x528" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 203" name="HSMCI_FIFO203" offset="0x52C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 204" name="HSMCI_FIFO204" offset="0x530" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 205" name="HSMCI_FIFO205" offset="0x534" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 206" name="HSMCI_FIFO206" offset="0x538" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 207" name="HSMCI_FIFO207" offset="0x53C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 208" name="HSMCI_FIFO208" offset="0x540" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 209" name="HSMCI_FIFO209" offset="0x544" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 210" name="HSMCI_FIFO210" offset="0x548" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 211" name="HSMCI_FIFO211" offset="0x54C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 212" name="HSMCI_FIFO212" offset="0x550" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 213" name="HSMCI_FIFO213" offset="0x554" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 214" name="HSMCI_FIFO214" offset="0x558" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 215" name="HSMCI_FIFO215" offset="0x55C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 216" name="HSMCI_FIFO216" offset="0x560" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 217" name="HSMCI_FIFO217" offset="0x564" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 218" name="HSMCI_FIFO218" offset="0x568" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 219" name="HSMCI_FIFO219" offset="0x56C" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 220" name="HSMCI_FIFO220" offset="0x570" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 221" name="HSMCI_FIFO221" offset="0x574" rw="RW" size="4"/>
        <register caption="FIFO Memory Aperture0 222" name="HSMCI_FIFO222" offset="0x578" rw="RW" size="4"/>
