Duet3D/Duet3Expansion/src/atmel/SAM4E_DFP/1.1.57/ic.sam4e/atdf/ATSAM4E16E.atdf
        <register caption="Transfer Control Register" name="PWM_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PWM_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
        </register-group>
      <value-group caption="" name="PWM_SCM__UPDM">
        <value caption="Manual write of double buffer registers and manual update of synchronous channels" name="MODE0" value="0x0"/>
        <value caption="Manual write of double buffer registers and automatic update of synchronous channels" name="MODE1" value="0x1"/>
        <value caption="Automatic write of duty-cycle update registers by the PDC and automatic update of synchronous channels" name="MODE2" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CMR0__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR1__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR2__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CMR3__CPRE">
        <value caption="Master clock" name="MCK" value="0x0"/>
        <value caption="Master clock/2" name="MCK_DIV_2" value="0x1"/>
        <value caption="Master clock/4" name="MCK_DIV_4" value="0x2"/>
        <value caption="Master clock/8" name="MCK_DIV_8" value="0x3"/>
        <value caption="Master clock/16" name="MCK_DIV_16" value="0x4"/>
        <value caption="Master clock/32" name="MCK_DIV_32" value="0x5"/>
        <value caption="Master clock/64" name="MCK_DIV_64" value="0x6"/>
        <value caption="Master clock/128" name="MCK_DIV_128" value="0x7"/>
        <value caption="Master clock/256" name="MCK_DIV_256" value="0x8"/>
        <value caption="Master clock/512" name="MCK_DIV_512" value="0x9"/>
        <value caption="Master clock/1024" name="MCK_DIV_1024" value="0xA"/>
        <value caption="Clock A" name="CLKA" value="0xB"/>
        <value caption="Clock B" name="CLKB" value="0xC"/>
      </value-group>
      <value-group caption="" name="PWM_CAE0__ADEDGM">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGV, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
      <value-group caption="" name="PWM_CAEUPD0__ADEDGMUP">
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="INC" value="0x0"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP and the counter of the channel x is incrementing." name="DEC" value="0x1"/>
        <value caption="The additional edge of the channel x output waveform occurs when CCNTx reaches ADEDGVUP, whether the counter is incrementing or not." name="BOTH" value="0x2"/>
      </value-group>
